<?php

require_once "blocks/header.php";
?>

   <header class="header">
        <div class="social">
            <a href="#" class="link"><i class='bx bxl-telegram'></i></a>
            <a href="#" class="link"><i class='bx bxl-github'></i></a>
            <a href="#" class="link"><i class='bx bxl-vk'></i></a>
            <a href="#" class="link"><i class='bx bxl-gmail'></i></a>
        </div>
        <div class="menu-toggle" id="menu-toggle">
            <div class="bar"></div>
            <div class="bar"></div>
            <div class="bar"></div>
        </div>
        <div class="logo">
            <p>Web-technologies-BSUIR</p>
        </div>
    </header>
    <div class="side-menu" id="side-menu">
        <div class="nav-bar">
            <ul>
                <li><a href="#" class="link">Пункт меню 1</a></li>
                <li><a href="#" class="link">Пункт меню 2</a></li>
                <li><a href="#" class="link">Пункт меню 3</a></li>
                <li><a href="#" class="link">Пункт меню 4</a></li>
            </ul>
        </div>
    </div>
    <section class="subject">
        <div class="subject_container">
            <div class="subject_container_text">
                <h1>Веб-программирование: искусство создания интерактивных и инновационных веб-сайтов</h1>
                <p>Веб-программирование – это увлекательный процесс создания интерактивных и функциональных веб-сайтов и приложений. Оно объединяет
                    в себе различные технологии, такие как HTML, CSS и JavaScript, а также серверные языки программирования, такие как PHP, Python,
                    Ruby и другие.Веб-программирование позволяет создавать мощные и инновационные решения для различных областей, от электронной коммерции
                    до образования и развлечений.</p>
            </div>
            <div class="subject_container_img"><img src="image/short-hair-man-with-vr.png" alt="man"></div>
        </div>
    </section>
    <section class="head">
        <button class="head_button" data-modal>Поставить оценку</button>
    </section>
    <section class="report">
        <h4>Report</h4>
        <div class="report_text">
            <p>Данный отчет представляет результат изучения основ языков гипертекстовой разметки HTML и управления визуальным
                оформлением HTML CSS, а также основ языка программирования PHP. В рамках данного исследования были изучены основные
                концепции и техники работы с каждым из этих языков, а также их взаимодействие для создания динамических веб-сайтов.
            </p>
            <hr class="hr">
            <p>
                Изучение основ HTML и CSS:<br>
                HTML (HyperText Markup Language) является основным языком разметки веб-страниц, который определяет структуру
                содержимого
                веб-страницы. CSS (Cascading Style Sheets) используется для оформления внешнего вида HTML-элементов. Были
                изучены основы HTML,
                такие как теги, атрибуты, элементы формы, а также CSS для стилизации веб-страниц.
            </p>
            <p>
                Изучение основ языка программирования PHP:<br>
                PHP (Hypertext Preprocessor) - это серверный язык программирования, который широко используется для создания
                динамических веб-сайтов. В рамках этого исследования были изучены основы PHP, такие как переменные, массивы,
                операторы, условные конструкции и циклы.
            </p>
            <p>
                Принципы работы с формами и GET/POST-запросами:<br>
                Формы HTML позволяют пользователям отправлять данные на сервер для обработки. Изучены основы работы с формами и передачи данных через GET и POST запросы, а также различия между ними.</p>
            <p>
                Изучение пользовательских функций и функций по работе с датой и временем:<br>
                PHP позволяет определять пользовательские функции для повторного использования кода. Кроме того, были изучены встроенные функции PHP для работы с датой, временем и файловой системой.</p>
            <p>
                Регулярные выражения в PHP:<br>
                Регулярные выражения - это мощный инструмент для поиска и обработки текстовых данных. В PHP они используются для выполнения различных операций, таких как поиск, замена и проверка строк на соответствие шаблону.</p>
            <p>
                Взаимодействие PHP с реляционными СУБД:<br>
                PHP позволяет взаимодействовать с различными реляционными базами данных, такими как MySQL, PostgreSQL и другими. В рамках исследования были изучены основы работы с базами данных и выполнения SQL запросов из PHP кода.</p>
            <p>
                SESSION (Сессии) и COOKIE (Куки):<br>
                Сессии и куки - это механизмы хранения данных на стороне клиента и сервера соответственно. Они позволяют сохранять информацию о пользователе и обеспечивать персонализированный опыт на веб-сайтах. Были изучены основы работы с сессиями и куками в PHP.</p>
            <p>
                Идентификация, авторизация пользователя:<br>
                Идентификация и авторизация пользователей - важные аспекты веб-разработки. Были изучены методы аутентификации и авторизации пользователей, включая использование сессий, куков и баз данных.</p>
            <p>
                Работа с почтой, отправка рассылок:<br>
                PHP позволяет отправлять электронные письма с помощью встроенных функций. Изучены основы работы с почтовыми функциями PHP для отправки сообщений и рассылок.</p>
            <p>
                Генерация и анализ статистики:<br>
                В PHP можно собирать и анализировать различную статистику о посещаемости веб-сайта. Изучены методы сбора данных о пользователях и анализа статистики с использованием PHP.
            </p>
            <hr class="hr">
            <p>
                Этот отчет представляет общий обзор изученных тем в рамках работы с HTML, CSS и PHP для создания динамических веб-сайтов.
            </p>
        </div>
    </section>
<?php

require_once "blocks/footer.php";
